In [29]:
import pandas as pd

In [30]:
df = pd.read_csv('data/lab5warmupdata.txt', delimiter='\t')

In [3]:
df.head()

  number1  number2
0   0,589  '0,589'
1   0,578  '0,578'
2   7,779  '7,779'
3   0,139  '0,139'
4   1,687  '1,687'

####Exercise 1: Strip the extra comma from the number1 column and convert to integer

In [6]:
df.number1 = df.number1.str.replace(",","")

In [7]:
df.number1.dtype

dtype('O')

In [8]:
df.number1 = df.number1.astype(int)

In [9]:
df.number1.dtype

dtype('int64')

In [10]:
df.head()

   number1  number2
0      589  '0,589'
1      578  '0,578'
2     7779  '7,779'
3      139  '0,139'
4     1687  '1,687'

In [16]:
df.number1 = df.number1.apply(lambda x: x.replace(",","")).astype(int)

AttributeError: 'numpy.int64' object has no attribute 'replace'

In [17]:
df.head()

   number1  number2
0      589  '0,589'
1      578  '0,578'
2     7779  '7,779'
3      139  '0,139'
4     1687  '1,687'

In [1]:
#Your code here



ANSWER

df.number1.apply(lambda x: x.replace(",","")).astype(int)

OR

def replace_comma(a):
    return x.replace(",","")

OR

df.number1.str.replace(",","").astype(int)

BUT THIS DOESNT WORK
df.number1.replace(",","")  -- because you need the str (string) method

IndentationError: expected an indented block (<ipython-input-1-e97074aff63a>, line 12)

In [26]:
#Bonus: Do it a different way



df.head()

  number1  number2
0   0,589  '0,589'
1   0,578  '0,578'
2   7,779  '7,779'
3   0,139  '0,139'
4   1,687  '1,687'

####Exercise 2: Strip the extra quotation marks from the column2 and convert to integer

In [32]:
df.number2 = df.number2.str[1:-1]
df.head()

  number1 number2
0   0,589   0,589
1   0,578   0,578
2   7,779   7,779
3   0,139   0,139
4   1,687   1,687

In [35]:
df.number2 = df.number2.str.replace(",","").astype(int)
df.head()

  number1  number2
0   0,589      589
1   0,578      578
2   7,779     7779
3   0,139      139
4   1,687     1687

In [36]:
df.number2.dtype

dtype('int64')

In [ ]:
#Your code here

x = 'otto'
x[1:-1]


df.number2.str[1:-1]